:PROPERTIES:
:ID:       0ce424b5-f020-4a3a-9409-e8a09406b9fa
:END:
#+title: Haskell Monoid

This the definition of a [[id:7e7c075d-77a4-4989-b9cc-2db2300c1887][monoid]] in [[id:857ff32f-0fe9-42cb-b72a-70d7aeaff7bd][Haskell]].

#+begin_src haskell
class (Semigroup m) => Monoid m where
  mempty :: m
  mappend :: m -> m -> m
  mappend = (<>)
#+end_src

mappend is some function which operator is ~<>~

In haskell we can write:

#+begin_src haskell :results verbatim :exports both :name mappend
xs = mappend [1,2,3] [4,5,6]
xs = [1,2,3] <> [4,5,6]
print xs
#+end_src

#+RESULTS:
: Prelude> [1,2,3,4,5,6]


What is the difference with ~++.~


#+begin_src haskell
:info Functor
#+end_src
